app/Controllers/usuario_controller.php

	public function formValidation() {

		$input = $this->validate([
    'nombre'   => 'required|min_length[3]',
    'apellido' => 'required|min_length[3]|max_length[25]',
    'username' => 'required|min_length[3]',
    'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
    'password' => 'required|min_length[3]|max_length[10]'
    ]);

		$formModel = new usuario_Model();

		if (!$input) {
		$data['titulo']='registrarse';
        echo view ('front/head_view', $data);
        echo view('front/navbar_view');
        echo view('back/usuario/registrarse', ['validation' => $this->validator]);
        echo view('front/footer_view');

		} else {
        $formModel->save([
            'nombre'   => $this->request->getVar('nombre'),
            'apellido' => $this->request->getVar('apellido'),
            'username' => $this->request->getVar('username'),
            'email'    => $this->request->getVar('email'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
        ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `username`, `email`, `password`) VALUES ('prueba', 'user', 'prueba', 'prueba@gmail.com', '$2y$10$P9JwF7.qIGksn6qSsrJJNeChneoGuOc4lahK6CJN1NMCOvNJwtfMq')